# SlotIndex Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalSystem..::..SlotIndex Property
ElectricalSystem Class See Also
---
The Slots where the Electrical System is located in its panel.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public string SlotIndex { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SlotIndex As String
	Get
```

Visual C++
---
```text
public:
property String^ SlotIndex {
	String^ get ();
}
```

# Remarks
This property is used to retrieve the slots of the Electrical System. There may be one or more slot in use in which case they will be comma delimited.
# See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace